#Если (НЕ ВебКлиент) Тогда

&НаКлиенте
Функция ПримерТестирования() 
	// Подключимся к тестируемому приложению
	ТестируемоеПриложение = Новый ТестируемоеПриложение("localhost",ПортТестКлиента,ИдентификаторТестВебКлиента);
	//ТестируемоеПриложение = Новый ТестируемоеПриложение("localhost",ПортТестКлиента);
	ТестируемоеПриложение.УстановитьСоединение();
	// Найдем главное окно
	ГлавноеОкноТестируемого = ТестируемоеПриложение.НайтиОбъект(Тип("ТестируемоеОкноКлиентскогоПриложения"));
	ГлавноеОкноТестируемого.Активизировать();
	// Выполним команду создания элемента справочника товаров
	ГлавноеОкноТестируемого.ВыполнитьКоманду("e1cib/command/Справочник.Товары.Создать");
	ТестируемоеПриложение.ОжидатьОтображениеОбъекта(Тип("ТестируемаяФорма"), "Товар*");
	ТестируемаяФорма = ТестируемоеПриложение.НайтиОбъект(Тип("ТестируемаяФорма"), "Товар*");
	ТестируемаяФорма.Активизировать();
	// Зададим наименование для нового товара
	ЭлементФормы = ТестируемаяФорма.НайтиОбъект(Тип("ТестируемоеПолеФормы"), "Наименование");
	ЭлементФормы.Активизировать();
	ЭлементФормы.ВвестиТекст("Новый товар");
	// Запишем элемент
	ЭлементФормы = ТестируемаяФорма.НайтиОбъект(Тип("ТестируемаяКнопкаФормы"), "Записать и закрыть");
	ЭлементФормы.Нажать();	
КонецФункции
	
#КонецЕсли

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресПубликацииВебКлиента = "http://localhost/TestWebClient/";
	ПортТестКлиента = "1538";
	ИдентификаторТестВебКлиента = "id1";
КонецПроцедуры


&НаКлиенте
Процедура ЗапуститьТестКлиент(Команда)
#Если (НЕ ВебКлиент) Тогда
	//ЗапуститьСистему("/TestClient Tport 1538", Ложь);
	СтрокаДляЗапускаВебКлиентаДляТестирования = АдресПубликацииВебКлиента + "?" + "L=RU" + "&" + "TestClient" + "&" + "TestClientID=" + ИдентификаторТестВебКлиента;
	//СтрокаДляЗапускаВебКлиентаДляТестирования = АдресПубликацииВебКлиента + "?" + "L=RU" + "&" + "TestClient";
	//http://localhost/TestWebClient/?L=RU&TestClient&TestClientID%3Cid1%3E
	ЗапуститьПриложение(СтрокаДляЗапускаВебКлиентаДляТестирования);
#КонецЕсли 
КонецПроцедуры



&НаКлиенте
Процедура ВыполнитьТест(Команда)
#Если (НЕ ВебКлиент) Тогда	
	ПримерТестирования();
#КонецЕсли
КонецПроцедуры

