#Если (НЕ ВебКлиент) Тогда

&НаКлиенте
Функция ПримерТестирования() 
	// Подключимся к тестируемому приложению
	ТестируемоеПриложение = Новый ТестируемоеПриложение("localhost");
	ТестируемоеПриложение.УстановитьСоединение();
	// Найдем главное окно
	ГлавноеОкноТестируемого = ТестируемоеПриложение.НайтиОбъект(Тип("ТестируемоеОкноКлиентскогоПриложения"));
	ГлавноеОкноТестируемого.Активизировать();
	// Выполним команду создания элемента справочника товаров
	ГлавноеОкноТестируемого.ВыполнитьКоманду("e1cib/command/Справочник.Товары.Создать");
	ТестируемоеПриложение.ОжидатьОтображениеОбъекта(Тип("ТестируемаяФорма"), "Товар*");
	ТестируемаяФорма = ТестируемоеПриложение.НайтиОбъект(Тип("ТестируемаяФорма"), "Товар*");
	ТестируемаяФорма.Активизировать();
	// Зададим наименование для нового товара
	ЭлементФормы = ТестируемаяФорма.НайтиОбъект(Тип("ТестируемоеПолеФормы"), "Наименование");
	ЭлементФормы.Активизировать();
	ЭлементФормы.ВвестиТекст("Новый товар");
	// Запишем элемент
	ЭлементФормы = ТестируемаяФорма.НайтиОбъект(Тип("ТестируемаяКнопкаФормы"), "Записать и закрыть");
	ЭлементФормы.Нажать();	
КонецФункции
	
#КонецЕсли

&НаКлиенте
Процедура ЗапуститьТестКлиент(Команда)
#Если (НЕ ВебКлиент) Тогда
	ЗапуститьСистему("/TestClient Tport 1538", Ложь);
#КонецЕсли 
КонецПроцедуры



&НаКлиенте
Процедура ВыполнитьТест(Команда)
	ПримерТестирования();
КонецПроцедуры

